{
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": "codeup-peft-llama-3-8b-wizardlm_evol_instruct_v2_143k/merged",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layers_pattern": null,
  "layers_to_transform": null,
  "lora_alpha": 64,
  "lora_dropout": 0.05,
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 32,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "k_proj",
    "up_proj",
    "q_proj",
    "down_proj",
    "v_proj"
  ],
  "task_type": "CAUSAL_LM"
}