{
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": "/hpc2hdd/home/jjiang472/OpenSource/Models/Meta-Llama-3-8B",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layers_pattern": null,
  "layers_to_transform": null,
  "lora_alpha": 64,
  "lora_dropout": 0.05,
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 32,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "up_proj",
    "q_proj",
    "v_proj",
    "k_proj",
    "down_proj"
  ],
  "task_type": "CAUSAL_LM"
}